# 피봇

In [10]:
import numpy as np
import pandas as pd

In [11]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [12]:
# df.pivot(행인덱스, 열인덱스, 데이터)
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [13]:
# 행인덱스를 멀티인덱스로. 버전 1.1.0 위에서만 가능
df1.pivot(["지역", "도시"], "연도", "인구")

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

In [14]:
pd.__version__

'1.1.0'

만약 버전이 낮아서 오류가 난다? <br>
anaconda cmd에서 conda create -n panda(가상환경이름) => 가상환경 만드는 일. <br>
즉 기본 base가 panda로 바뀌는 것 <br>
conda deactivate (기본 base에서 나가기) <br>
conda install pandas <br>
conda install jupyter notebook <br>
그리고 나서 vscode가 실행되는 경로를 c:\ProgramData\Anaconda3\envs 들어가서 panda를 찾으면 버전이 위에서 설치된 애로 됨

# 그룹 분석
SQL에서 GROUP BY 쓰듯이 쓰면 됨
groupby(열 or 열의 리스트 or 행 리스트)

groupby(인수).메소드 로 올수있는 애들
- size, count: 그룹 데이터의 갯수
- mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대
- sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수
- first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터

In [17]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [18]:
groups = df2.groupby(df2.key1) # 열이 인자로 들어감 => A,B가 나오겠지
groups # 여기까지는 객체만 나옴

In [20]:
groups.groups # 딕셔너리 형태

{'A': [0, 1, 4], 'B': [2, 3]}

In [22]:
# 뒤에 메소드를 써줘야 비로소 DafaFrame이 나온다.
# 그래서 애초에 groupby().method 로 한 번에 쓴다
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [23]:
df2.groupby(df2.key1).mean()

         data1      data2
key1
A     2.666667  26.666667
B     3.500000  35.000000

In [27]:
df2.groupby(df2.key1).data1.sum()
# 요건 위 DF에서 data1이라는 시리즈만 보고싶다! 라고 얘기하는것

key1
A    8
B    7
Name: data1, dtype: int64

In [28]:
df2.groupby(df2.key1)[['data1','data2']].sum()

      data1  data2
key1
A         8     80
B         7     70

In [29]:
df2.groupby(df2.key1)[['data1']].sum()
# 열 하나만인데도 중첩리스트로 가져오면 결과가 DF다

      data1
key1
A         8
B         7

In [30]:
# 열을 먼저 해도 돌아간다
df2[['data1','data2']].groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

붓꽃 데이터

- agg, aggregate <br>
만약 원하는 그룹연산이 없는 경우 함수를 만들고 이 함수를 agg에 전달한다.
또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.
- describe <br>
하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.
- apply <br>
describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다.
- transform <br>
그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.

In [35]:
import seaborn as sns
iris = sns.load_dataset("iris")
iris.head(8)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa

In [38]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()    
""" 내가 만든 함수를 agg(안에) 넣어준다. """

# list의 map 함수가 리스트의 모든 원소에 대해 적용되는 것처럼, groupby로 그루핑된 데이터 모두 가지고(그 모두 중에) max와 min을 찾아서 max/min 값을

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [43]:
# 기초통계량을 보여줌
iris.groupby(iris.species).sepal_length.describe().T

species    setosa  versicolor  virginica
count    50.00000   50.000000   50.00000
mean      5.00600    5.936000    6.58800
std       0.35249    0.516171    0.63588
min       4.30000    4.900000    4.90000
25%       4.80000    5.600000    6.22500
50%       5.00000    5.900000    6.50000
75%       5.20000    6.300000    6.90000
max       5.80000    7.000000    7.90000

In [49]:
def top3_petal_length(df):
    return df.sort_values(by="petal_length", ascending=False)[:3]
    # MySQL order by desc limit 3 이랑 똑같음
    
iris.groupby(iris.species).apply(top3_petal_length) 
# axis=0 디폴트니까 행을 기준으로

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

In [57]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)

iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)

# 원래 데이터를 내 데이터 : 내가 만든 함수의 return값으로 바꿔치기

iris[["petal_length", "petal_length_class"]].tail(10)

     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

In [ ]:
# 붓꽃(iris) 데이터에서 붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width) 등의 평균을 구하라. 만약 붓꽃 종(species)이 표시되지 않았을 때 이 수치들을 이용하여 붓꽃 종을 찾아낼 수 있을지 생각하라.

iris.groupby(iris.species)[['sepal_length','sepal_width']].mean()

# 피봇 테이블
pivot 명령과 groupby 명령의 중간 성격 <br>
groupby 명령처럼 그룹분석을 하지만 최종적으로는 pivot 명령처럼 피봇테이블을 만듦

In [60]:
""" 파라미터가 왜 대체 통일이 안 되있노 """
# pivot(행인덱스, 열인덱스, 데이터)
# pivot_table(데이터, 행인덱스, 열인덱스)
df1.pivot_table("인구", "도시", "연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [65]:
# margins=True는 axis=0, axis=1 으로 평균(둘다)
# margins_name 은 추가되는 행/열 이름
df1.pivot_table("인구", "도시", "연도", margins=True, margins_name="평균")

연도       2005       2010       2015            평균
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
평균  6637546.5  4429292.0  5414500.0  5.350809e+06

In [68]:
df1.인구.mean

<bound method Series.mean of 0    9904312
1    9631482
2    9762546
3    3448737
4    3393191
5    3512547
6    2890451
7     263203
Name: 인구, dtype: int64>

In [69]:
# 멀티인덱스
df1.pivot_table("인구", index=["연도", "도시"])

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [74]:
# tip 데이터셋
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [78]:
# 팁 퍼센트
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [81]:
# 범주형 제외하고 다 나온다
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [85]:
tips.groupby("sex").size()

sex
Male      157
Female     87
dtype: int64

In [86]:
# groupby는 메소드랑 같이 안 나오면 객체로만 나옴
tips.groupby(["sex", "smoker"]).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [90]:
# 피봇테이블은 객체 이런거 없이 바로 DF로 나옴
# aggfunc. 데이터가 원소 개수로 나온다
tips.pivot_table('tip_pct','sex','smoker', aggfunc='count', margins=True)

smoker  Yes   No  All
sex
Male     60   97  157
Female   33   54   87
All      93  151  244

In [94]:
# 성별과 팁 비율
tips.groupby("sex")[["tip_pct"]].mean()

         tip_pct
sex
Male    0.157651
Female  0.166491

In [95]:
# 흡연과 팁 비율
tips.groupby("smoker")[["tip_pct"]].mean()

         tip_pct
smoker
Yes     0.163196
No      0.159328

In [97]:
# 똑같은 걸 pivot_table로도 구할 수 있다
# tip_pct데이터, sex행 
tips.pivot_table("tip_pct", "sex")

         tip_pct
sex
Male    0.157651
Female  0.166491

In [99]:
# 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.
# 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [116]:
tips.groupby([tips.day, tips.time]).mean()

             total_bill       tip      size   tip_pct
day  time
Thur Lunch    17.664754  2.767705  2.459016  0.161301
     Dinner   18.780000  3.000000  2.000000  0.159744
Fri  Lunch    12.845714  2.382857  2.000000  0.188765
     Dinner   19.663333  2.940000  2.166667  0.158916
Sat  Lunch          NaN       NaN       NaN       NaN
     Dinner   20.441379  2.993103  2.517241  0.153152
Sun  Lunch          NaN       NaN       NaN       NaN
     Dinner   21.410000  3.255132  2.842105  0.166897

In [126]:
tips.pivot_table('tip_pct','size',['day','time']).T

size                1         2         3         4         5         6
day  time
Thur Lunch   0.181728  0.164024  0.144599  0.145515  0.121389  0.173706
     Dinner       NaN  0.159744       NaN       NaN       NaN       NaN
Fri  Lunch   0.223776  0.181969  0.187735       NaN       NaN       NaN
     Dinner       NaN  0.162659       NaN  0.117750       NaN       NaN
Sat  Dinner  0.231832  0.155289  0.151439  0.138289  0.106572       NaN
Sun  Dinner       NaN  0.180870  0.152662  0.153168  0.159839  0.103799

In [125]:
tips.pivot_table('tip_pct','day','time', margins = True)

time     Lunch    Dinner       All
day
Thur  0.161301  0.159744  0.161276
Fri   0.188765  0.158916  0.169913
Sat        NaN  0.153152  0.153152
Sun        NaN  0.166897  0.166897
All   0.164128  0.159518  0.160803

In [131]:
# agg 자리에 내가 만든 함수 넣어보기
def peak_to_peak(x):
    return x.max() - x.min()

# tips.groupby(["sex", "smoker"])[["tip"]].agg(peak_to_peak)

# 많이 먹었으면 많이 내고, 적게 먹었으면 적게 낼테니 raw데이터 말고 퍼센트를 봐야 안다
# 마치 코로나 검사 숫자처럼
tips.groupby(["sex", "smoker"])[["tip_pct"]].agg(peak_to_peak)

                tip_pct
sex    smoker
Male   Yes     0.674707
       No      0.220186
Female Yes     0.360233
       No      0.195876

In [133]:
# agg에 여러 함수를 넣을 수 있다.
tips.groupby(["sex", "smoker"])[["tip_pct"]].agg(["mean",peak_to_peak])

                tip_pct
                   mean peak_to_peak
sex    smoker
Male   Yes     0.152771     0.674707
       No      0.160669     0.220186
Female Yes     0.182150     0.360233
       No      0.156921     0.195876

In [134]:
# 데이터 열마다 연산을 다르게하고싶다면?
tips.groupby(["sex", "smoker"]).agg({'tip_pct': 'mean', 'total_bill': peak_to_peak})

                tip_pct  total_bill
sex    smoker
Male   Yes     0.152771       43.56
       No      0.160669       40.82
Female Yes     0.182150       41.23
       No      0.156921       28.58